Repository: miketarchan/Uranium
Catalog: resources/i18n/*/uranium.po
Languages: uk_ua

# @item:inmenu
source: Simple
uk_ua: Простий

# @item:inlistbox
source: STL File
uk_ua: STL Файл

# @item:inlistbox
source: Wavefront OBJ File
uk_ua: Файл Wavefront OBJ

# @error:not supported
source: OBJWriter does not support non-text mode.
uk_ua: Засіб запису OBJ (OBJWriter) не підтримує нетекстовий режим.

# @error:no mesh
source: There is no mesh to write.
uk_ua: Об’єкт для запису відсутній.

# @item:inlistbox
source: STL File (ASCII)
uk_ua: STL Файл (ASCII)

# @item:inlistbox
source: STL File (Binary)
uk_ua: STL Файл (Binary)

# @error:not supported
source: Unsupported output mode writing STL to stream.
uk_ua: Режим запису STL для потоковой передачі не підтримується.

# @info
source: Could not access update information.
uk_ua: Не вдається отримати інформацію про оновлення.

# @info:title
source: Version Upgrade
uk_ua: Оновлення Версії

# @info
source: The version you are using does not support checking for updates.
uk_ua: Використовувана вами версія не підтримує перевірку оновлень.

# @info:title
source: Warning
uk_ua: Увага

# @info
source: An error occurred while checking for updates.
uk_ua: Виникла помика під час перевірки наявності оновлень.

# @info:title
source: Error
uk_ua: Помилка

# @info
source: No new version was found.
uk_ua: Не знайдено нової версії.

# @info:status
source: {application_name} {version_number} is available!
uk_ua: {application_name} {version_number} є доступною!

# @info:status
source: {application_name} {version_number} provides a better and more reliable printing experience.
uk_ua: {application_name} {version_number} забезпечує більш якісний і надійний друк.

# @action:button
source: Download
uk_ua: Завантажити

# @action:button
source: Learn more
uk_ua: Дізнатись більше

# @item:inmenu
source: Update Checker
uk_ua: Перевірка оновлень

# @item:inmenu
source: Check for Updates
uk_ua: Перевірити наявність оновлень

# @item:inmenu
source: Local File
uk_ua: Локальний файл

# @action:button Preceded by 'Ready to'.
source: Save to File
uk_ua: Зберегти у файл

# @info:tooltip
source: Save to File
uk_ua: Зберегти у файл

# @title:window
source: Save to File
uk_ua: Зберегти у файл

# @info:warning
source: There are no file types available to write with!
uk_ua: Ні один із типів файлів не достуний для запису!

# @title:window
source: File Already Exists
uk_ua: Файл вже існує

# @label Don't translate the XML tag <filename>!
source: The file <filename>{0}</filename> already exists. Are you sure you want to overwrite it?
uk_ua: Файл <filename>{0}</filename> вже існує. Ви впевнені що хочете його перезаписати?

# @info:progress Don't translate the XML tags <filename>!
source: Saving to <filename>{0}</filename>
uk_ua: Збереження в <filename>{0}</filename>

# @info:title
source: Saving
uk_ua: Збереження

# @info:status Don't translate the XML tags <filename>!
source: Permission denied when trying to save <filename>{0}</filename>
uk_ua: Не достатньо прав для збереження <filename>{0}</filename>

# @info:status Don't translate the XML tags <filename> or <message>!
source: Could not save to <filename>{0}</filename>: <message>{1}</message>
uk_ua: Неможливо зберегти файл <filename>{0}</filename>: <message>{1}</message>

# @info:status Don't translate the XML tags <filename>!
source: Saved to <filename>{0}</filename>
uk_ua: Збереження в <filename>{0}</filename>

# @info:title
source: File Saved
uk_ua: Файл збережено

# @action:button
source: Open Folder
uk_ua: Відкрити папку

# @info:tooltip
source: Open the folder containing the file
uk_ua: Відкрити папку, в якій міститься цей файл

# @info:status
source: Something went wrong saving to <filename>{0}</filename>: <message>{1}</message>
uk_ua: Щось трапилось під час збереження <filename>{0}</filename>: <message>{1}</message>

# @label
source: Scale
uk_ua: Масштаб

# @info:tooltip
source: Scale Model
uk_ua: Масштабувати модель

# @action:button
source: Move
uk_ua: Перемістити

# @info:tooltip
source: Move Model
uk_ua: Переміщення моделі

# @label
source: Rotate
uk_ua: Обернути

# @info:tooltip
source: Rotate Model
uk_ua: Обернути модель

# @label
source: Laying object flat on buildplate...
uk_ua: Плоске горизонтальне розміщення об’єкта на столі для друку.

# @title
source: Object Rotation
uk_ua: Обертання об’єкта

# @label
source: Mirror
uk_ua: Віддзеркалення

# @info:tooltip
source: Mirror Model
uk_ua: Віддзеркалення моделі

# @info:status
source: Your configuration seems to be corrupt. Something seems to be wrong with the following profiles: - {profiles} Would you like to reset to factory defaults?
uk_ua: Схоже на те, що дані вашої конфігурації пошкодженні. Виникли проблеми із наступними профілями: - {profiles} Бажаєте відновити налаштування до заводських?

# @info:status
source: Your configuration seems to be corrupt.
uk_ua: Дані вашої конфігурації пошкодженні.

# @info:title
source: Configuration errors
uk_ua: Помилки конфігурації

# @info:button
source: Reset your configuration to factory defaults.
uk_ua: Відновити налаштування конфігурації до заводських.

# @item:inlistbox
source: All Supported Types ({0})
uk_ua: Всі підтримувані типи ({0})

# @item:inlistbox
source: All Files (*)
uk_ua: Всі файли (*)

# @error:uninstall
source: There were some errors uninstalling the following packages: {packages}
uk_ua: Виникли деякі проблеми під час видалення наступних пакетів: {packages}

# @info:title
source: Uninstalling errors
uk_ua: Помилки під час видалення

# @error:update
source: There was an error uninstalling the package {package} before installing new version: {error}. Please try to upgrade again later.
uk_ua: Виникла проблема під час видалення пакета {package} перед встановлення нової версії: {error}. Спробуйте оновити ще раз пізніше.

# @info:title
source: Updating error
uk_ua: Помилка під час оновлення

source: {0:0>2}d {1:0>2}h {2:0>2}min
uk_ua: {0:0>2}д {1:0>2}г {2:0>2}хв

# @label Short hours-minutes format. {0} is hours, {1} is minutes
source: {0:0>2}h {1:0>2}min
uk_ua: {0:0>2}г {1:0>2}хв

# @label Long duration format. {0} is days
source: {0} day
uk_ua: {0} день

# @label Long duration format. {0} is hours
source: {0} hour
uk_ua: {0} година

# @label Long duration format. {0} is minutes
source: {0} minute
uk_ua: {0} хвилина

# @info:progress
source: Initializing package manager...
uk_ua: Ініціалізація пакетного менеджера…

# @info:progress
source: Loading plugins...
uk_ua: Завантаження плагінів…

# @info:progress
source: Updating configuration...
uk_ua: Оновлення конфігурації…

# @info:progress
source: Loading preferences...
uk_ua: Завантаження налаштувань…

# @info:status
source: Auto scaled object to {0}% of original size
uk_ua: Автоматичне масштабування об’єкта до {0}% відносно оригінального розміру

# @info:title
source: Scaling Object
uk_ua: Масштабування об’єкта

# @info:status
source: The plugin has been installed. Please re-start the application to activate the plugin.
uk_ua: Плагін встановлено. Будь ласка, перезапустіть програму для активації плагіна.

# @info:status
source: The plugin has been removed. Please restart {0} to finish uninstall.
uk_ua: Плагін видалено. Буль ласка, перезапустіть {0} для завершення видалення.

# @info:version-upgrade
source: A configuration from an older version of {0} was imported.
uk_ua: Була імпортована конфігурація із старішої версії {0}.

# @message
source: Failed to Initialize OpenGL
uk_ua: Не вдалося ініціалізувати OpenGL

# Critical OpenGL Extensions Missing
source: Critical OpenGL extensions are missing. This program requires support for Framebuffer Objects. Please check your video card drivers.
uk_ua: Відсутні важливі OpenGL розширення. Ця програма потребує підтримки для об’єктів фреймбуфера. Буда ласка, перевірки драйвера вашої відео карти.

# @action:button
source: Reset
uk_ua: Скинути

# @info:status
source: Your configuration seems to be corrupt. Something seems to be wrong with the following profiles: - {profiles} Would you like to reset to factory defaults? Reset will remove all your current printers and profiles.
uk_ua: Здається, ваша конфігурація пошкоджена. Виникли проблеми із наступними профілями: - {profiles} Бажаєте відновити налаштування до заводських? Скидання видалить всі існуючі принтери і профіля.

# @title:window
source: Reset to factory
uk_ua: Відновлення налаштувань до заводських

# @label
source: Reset will remove all your current printers and profiles! Are you sure you want to reset?
uk_ua: Скидання видалить всі існуючі принтери і профіля! Ви впевнені, що хочете скинути налаштування?

# @info
source: Would you like to reload {filename}?
uk_ua: Перезавантажити {filename}?

# @info:title
source: File has been modified
uk_ua: Файл було змінено

# @action:button
source: Reload
uk_ua: Перезавантажити

# @action:description
source: This will trigger the modified files to reload from disk.
uk_ua: Це запустить перезавантаження змінених файлів з диска.

# @info:status Don't translate the XML tag <filename>!
source: Cannot open files of the type of <filename>{0}</filename>
uk_ua: Не вдалося відкрити файли типу <filename>{0}</filename>

# @info:title
source: Invalid File
uk_ua: Неправильний файл

# @info:status Don't translate the XML tag <filename>!
source: Failed to load <filename>{0}</filename>
uk_ua: Не можливо відкрити <filename>{0}</filename>

# @info:title
source: Loading
uk_ua: Завантаження

# @option:check
source: Snap Scaling
uk_ua: Швидке масштабування

# @option:check
source: Uniform Scaling
uk_ua: Звичайне масштабування

# @option:check
source: Lock Model
uk_ua: Заблокувати модель

# @action:button
source: Lay flat
uk_ua: Положити плоскою стороною

# @action:button
source: Select face to align to the build plate
uk_ua: Виберіть поверхність для вирівнювання із столом для друку

# @action:checkbox
source: Snap Rotation
uk_ua: Швидке обертання

# @title:window
source: Preferences
uk_ua: Налаштування

# @action:button
source: Defaults
uk_ua: Стандартні

# @action:button
source: Close
uk_ua: Закрити

# @title:tab
source: General
uk_ua: Загальні

# @title:tab
source: Settings
uk_ua: Параметри

# @title:window
source: Rename
uk_ua: Перейменувати

# @info
source: Please provide a new name.
uk_ua: Вкажіть нове ім’я.

# @action:button
source: Cancel
uk_ua: Відмінити

# @action:button
source: OK
uk_ua: ОК

# @item:tooltip
source: This setting has been hidden by the active machine and will not be visible.
uk_ua: Даний параметр був прихований поточним принтером і не буде відображатись.

# @item:tooltip %1 is list of setting names
source: This setting has been hidden by the value of %1. Change the value of that setting to make this setting visible.
uk_ua: Цей параметр був прихований значенням %1. Змініть це значення, щоб параметр заново відобразився.

# @title:tab
source: Printers
uk_ua: Принтери

# @label
source: Type
uk_ua: Тип

# @title:window
source: Confirm Remove
uk_ua: Підтверджень видалення

# @label (%1 is object name)
source: Are you sure you wish to remove %1? This cannot be undone!
uk_ua: Ви впевнені, що хочете видалити %1? Це не можу бути скасовано!

# @action:button
source: Back
uk_ua: Назад

# @action:button
source: Finish
uk_ua: Завершити

# @action:button
source: Next
uk_ua: Далі

# description
source: Example extension to instruct people on how to create Uranium extensions.
uk_ua: Приклад доповнення для навчання створенню доповнень Uranium.

# name
source: Example Extension
uk_ua: Приклад Доповнення

# description
source: Provides a simple solid mesh view.
uk_ua: Забезпечує перегляд у вигляді цілого тіла.

# name
source: Simple View
uk_ua: Звичайний вид

# description
source: Outputs log information to a file in your settings folder.
uk_ua: Виводить вмісь журналу у файл, який розташовується у папці із вашими налаштуваннями.

# name
source: File Logger
uk_ua: Запис журналу у файл

# description
source: Provides support for reading STL files.
uk_ua: Забезпечує підтримку для читання STL файлів.

# name
source: STL Reader
uk_ua: Читання STL

# description
source: Makes it possible to read Wavefront OBJ files.
uk_ua: Дозволяє читати файли Wavefront OBJ.

# name
source: Wavefront OBJ Reader
uk_ua: Читання Wavefront OBJ

# description
source: Makes it possible to write Wavefront OBJ files.
uk_ua: Дозволяє зберігати файли Wavefront OBJ.

# name
source: Wavefront OBJ Writer
uk_ua: Збереження Wavefront OBJ

# description
source: Provides support for writing STL files.
uk_ua: Забезпечує підтримку запису STL файлів.

# name
source: STL Writer
uk_ua: Запис STL

# description
source: Outputs log information to the console.
uk_ua: Виводить журнал в консоль.

# name
source: Console Logger
uk_ua: Консольний журнал

# description
source: Example tool to instruct people on how to create Uranium tools.
uk_ua: Приклад інструмента для навчання створенню інструментів Uranium.

# name
source: Example Tool
uk_ua: Приклад інструмента

# description
source: Example output device to instruct people on how to create Uranium output devices.
uk_ua: Приклад вихідного пристро для навчання створенню вихідних пристроїв Uranium.

# name
source: Example Output Device
uk_ua: Приклад вихідного пристрою

# description
source: Checks for updates of the software.
uk_ua: Перевіряє наявність оновлення ПО.

# name
source: Update Checker
uk_ua: Перевірка оновлень

# description
source: Example file reader to instruct people on how to create Uranium file readers.
uk_ua: Приклад засобу читання файлів для навчання створення засобів читання Uranium.

# name
source: Example File Reader
uk_ua: Приклад засобу читання

# description
source: Enables saving to local files.
uk_ua: Дозволяє зберігання в локальні файли.

# name
source: Local File Output Device
uk_ua: Засіб виведення локальних файлів.

# description
source: Provides built-in setting containers that come with the installation of the application.
uk_ua: Формує вбудовані контейнери налаштувань, які поставляються із встановленням програми.

# name
source: Local Container Provider
uk_ua: Локальний Постачальник

# description
source: Provides the Scale tool.
uk_ua: Надає інструмент “Масштаб”.

# name
source: Scale Tool
uk_ua: Інструмент Масштабу

# description
source: Provides the Selection tool.
uk_ua: Надає інструмент “Вибір”.

# name
source: Selection Tool
uk_ua: Інструмент Вибору

# description
source: Provides the Move tool.
uk_ua: Надає інструмент “Переміщення”.

# name
source: Move Tool
uk_ua: Інструмент Переміщення

# description
source: Provides the tool to manipulate the camera.
uk_ua: Надає інструмент для управління камерою.

# name
source: Camera Tool
uk_ua: Управління Камерою

# description
source: Provides the Rotate tool.
uk_ua: Нада інструмент “Обертання”.

# name
source: Rotate Tool
uk_ua: Інструмент Обертання

# description
source: Provides the Mirror tool.
uk_ua: Надає інструмент “Віддзеркалення”.

# name
source: Mirror Tool
uk_ua: Інструмент Віддзеркалення
